# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'mas-cli/tap'

# Binaries
brew 'awscli'
brew 'bash' # Bash 4
brew 'bat'
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'mackup'
brew 'mas'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'trash'
brew 'tree'
brew 'wget'
brew 'htop-osx'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'imagick'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask 'aerial'
# cask 'alfred'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'eid-be'
cask 'eid-be-viewer'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'insomnia'
cask 'java'
cask 'mysqlworkbench'
brew 'openvpn'
cask 'phpstorm'
cask 'postman'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
# cask 'sublime-text'
cask 'tableplus'
cask 'there'
cask 'tor-browser'
cask 'tower2'
cask 'transmit'
cask 'vagrant'
cask 'vlc'
cask 'spotify'
cask 'sonos'
cask 'virtualbox'
cask 'virtualbox-extension-pack'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas '1Password', id: 1333542190
mas 'LastPass', id: 926036361
mas 'Byword', id: 420212497
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Numbers' id: 409203825
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
mas 'Unsplash', id: 1284863847
mas 'WhatsApp', id: 1147396723 
mas 'Magnet', id: 441258766
mas 'Monit', id: 1014850245
mas 'Slack', id: 803453959
mas 'Amphetamine', id: 937984704
